MikroElektronika/core_packages/ARM/gcc_clang/def/pic32/PIC32CZ4010CA80176/mcu.h
/*
 * Header file for PIC32CZ4010CA80176
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* File generated from device description file (ATDF) version 2024-10-01T16:24:03Z */
#ifndef _PIC32CZ4010CA80176_H_
#define _PIC32CZ4010CA80176_H_

/* Header version uses Semantic Versioning 2.0.0 (https://semver.org/) */
#define HEADER_FORMAT_VERSION "2.1.1"

#define HEADER_FORMAT_VERSION_MAJOR (2)
#define HEADER_FORMAT_VERSION_MINOR (1)
#define HEADER_FORMAT_VERSION_PATCH (1)

/* PIC32CZ4010CA80176 definitions
  This file defines all structures and symbols for PIC32CZ4010CA80176:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  include <stdint.h>
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !defined(SKIP_INTEGER_LITERALS)
#  if defined(_UINT8_) || defined(_UINT16_) || defined(_UINT32_)
#    error "Integer constant value macros already defined elsewhere"
#  endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Macros that deal with sizes of integer constants for C/C++ */
#  define _UINT8_(x)   ((uint8_t)(x))    /* C code: 8-bits unsigned integer constant value */
#  define _UINT16_(x)  ((uint16_t)(x))   /* C code: 16-bits unsigned integer constant value */
#  define _UINT32_(x)  ((uint32_t)(x))   /* C code: 32-bits unsigned integer constant value */

#else /* Assembler */

#  define _UINT8_(x) x    /* Assembler: 8-bits unsigned integer constant value */
#  define _UINT16_(x) x   /* Assembler: 16-bits unsigned integer constant value */
#  define _UINT32_(x) x   /* Assembler: 32-bits unsigned integer constant value */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* SKIP_INTEGER_LITERALS */

/* ************************************************************************** */
/*                  CMSIS DEFINITIONS FOR PIC32CZ4010CA80176                  */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Interrupt Number Definition */
typedef enum IRQn
{
/******  CORTEX-M7 Processor Exceptions Numbers ******************************/
  Reset_IRQn                = -15, /* -15 Reset Vector, invoked on Power up and warm reset */
  NonMaskableInt_IRQn       = -14, /* -14 Non maskable Interrupt, cannot be stopped or preempted */
  HardFault_IRQn            = -13, /* -13 Hard Fault, all classes of Fault    */
  MemoryManagement_IRQn     = -12, /* -12 Memory Management, MPU mismatch, including Access Violation and No Match */
  BusFault_IRQn             = -11, /* -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault */
  UsageFault_IRQn           = -10, /* -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition */
  SVCall_IRQn               =  -5, /* -5  System Service Call via SVC instruction */
  DebugMonitor_IRQn         =  -4, /* -4  Debug Monitor                       */
  PendSV_IRQn               =  -2, /* -2  Pendable request for system service */
  SysTick_IRQn              =  -1, /* -1  System Tick Timer                   */

/* ************* PIC32CZ4010CA80176 specific Interrupt Numbers ************** */
  FCW_IRQn                  =   0, /* 0   Flash Write Control (FCW) (FCW)     */
  FCR_ECCERR_IRQn           =   1, /* 1   Flash Read Controller (FCR) (FCR)   */
  FCR_CRC_FAULT_IRQn        =   2, /* 2   Flash Read Controller (FCR) (FCR)   */
  PM_IRQn                   =   3, /* 3   Power Manager (PM)                  */
  SUPC_IRQn                 =   4, /* 4   Supply Controller (SUPC)            */
  OSCCTRL_FAIL_IRQn         =   5, /* 5   Oscillators Control (OSCCTRL)       */
  OSCCTRL_XOSCRDY_IRQn      =   6, /* 6   Oscillators Control (OSCCTRL)       */
  OSCCTRL_DFLLRDY_IRQn      =   7, /* 7   Oscillators Control (OSCCTRL)       */
  OSCCTRL_OTHER_IRQn        =   8, /* 8   Oscillators Control (OSCCTRL)       */
  OSCCTRL_LOCK_IRQn         =   9, /* 9   Oscillators Control (OSCCTRL)       */
  OSC32KCTRL_FAIL_IRQn      =  10, /* 10  32kHz Oscillators Control (OSC32KCTRL) */
  OSC32KCTRL_RDY_IRQn       =  11, /* 11  32kHz Oscillators Control (OSC32KCTRL) */
  MCLK_IRQn                 =  12, /* 12  Main Clock (MCLK)                   */
  FREQM_IRQn                =  13, /* 13  Frequency Meter (FREQM)             */
  WDT_IRQn                  =  14, /* 14  Watchdog Timer (WDT)                */
  RTC_TAMPER_IRQn           =  15, /* 15  Real-Time Counter (RTC)             */
  RTC_OVF_IRQn              =  16, /* 16  Real-Time Counter (RTC)             */
  RTC_PERIOD_IRQn           =  17, /* 17  Real-Time Counter (RTC)             */
  RTC_COMPARE_IRQn          =  18, /* 18  Real-Time Counter (RTC)             */
  EIC_EXTINT_0_IRQn         =  19, /* 19  External Interrupt Controller (EIC) */
  EIC_EXTINT_1_IRQn         =  20, /* 20  External Interrupt Controller (EIC) */
  EIC_EXTINT_2_IRQn         =  21, /* 21  External Interrupt Controller (EIC) */
  EIC_EXTINT_3_IRQn         =  22, /* 22  External Interrupt Controller (EIC) */
  EIC_EXTINT_4_IRQn         =  23, /* 23  External Interrupt Controller (EIC) */
  EIC_EXTINT_5_IRQn         =  24, /* 24  External Interrupt Controller (EIC) */
  EIC_EXTINT_6_IRQn         =  25, /* 25  External Interrupt Controller (EIC) */
  EIC_EXTINT_7_IRQn         =  26, /* 26  External Interrupt Controller (EIC) */
  EIC_EXTINT_8_IRQn         =  27, /* 27  External Interrupt Controller (EIC) */
  EIC_EXTINT_9_IRQn         =  28, /* 28  External Interrupt Controller (EIC) */
  EIC_EXTINT_10_IRQn        =  29, /* 29  External Interrupt Controller (EIC) */
  EIC_EXTINT_11_IRQn        =  30, /* 30  External Interrupt Controller (EIC) */
  EIC_EXTINT_12_IRQn        =  31, /* 31  External Interrupt Controller (EIC) */
  EIC_EXTINT_13_IRQn        =  32, /* 32  External Interrupt Controller (EIC) */
  EIC_EXTINT_14_IRQn        =  33, /* 33  External Interrupt Controller (EIC) */
  EIC_EXTINT_15_IRQn        =  34, /* 34  External Interrupt Controller (EIC) */
  PAC_IRQn                  =  35, /* 35  Peripheral Access Controller (PAC)  */
  DRMTCM_IRQn               =  36, /* 36  DRM TCM ECC (DRMTCM)                */
  MCRAMC_IRQn               =  37, /* 37  Multi-Channel RAM Controller (MCRAMC) */
  TRAM_IRQn                 =  38, /* 38  TrustRAM (TRAM)                     */
  DMA_PRI3_IRQn             =  39, /* 39  Direct Memory Access Controller (DMA) */
  DMA_PRI2_IRQn             =  40, /* 40  Direct Memory Access Controller (DMA) */
  DMA_PRI1_IRQn             =  41, /* 41  Direct Memory Access Controller (DMA) */
  DMA_PRI0_IRQn             =  42, /* 42  Direct Memory Access Controller (DMA) */
  EVSYS_0_IRQn              =  43, /* 43  Event System Interface (EVSYS)      */
  EVSYS_1_IRQn              =  44, /* 44  Event System Interface (EVSYS)      */
  EVSYS_2_IRQn              =  45, /* 45  Event System Interface (EVSYS)      */
  EVSYS_3_IRQn              =  46, /* 46  Event System Interface (EVSYS)      */
  EVSYS_4_IRQn              =  47, /* 47  Event System Interface (EVSYS)      */
  EVSYS_5_IRQn              =  48, /* 48  Event System Interface (EVSYS)      */
  EVSYS_6_IRQn              =  49, /* 49  Event System Interface (EVSYS)      */
  EVSYS_7_IRQn              =  50, /* 50  Event System Interface (EVSYS)      */
  EVSYS_8_IRQn              =  51, /* 51  Event System Interface (EVSYS)      */
  EVSYS_9_IRQn              =  52, /* 52  Event System Interface (EVSYS)      */
  EVSYS_10_IRQn             =  53, /* 53  Event System Interface (EVSYS)      */
  EVSYS_11_IRQn             =  54, /* 54  Event System Interface (EVSYS)      */
  SERCOM0_6_IRQn            =  55, /* 55  Serial Communication Interface (SERCOM0) */
  SERCOM0_5_IRQn            =  56, /* 56  Serial Communication Interface (SERCOM0) */
  SERCOM0_0_IRQn            =  57, /* 57  Serial Communication Interface (SERCOM0) */
  SERCOM0_1_IRQn            =  58, /* 58  Serial Communication Interface (SERCOM0) */
  SERCOM0_2_IRQn            =  59, /* 59  Serial Communication Interface (SERCOM0) */
  SERCOM0_3_IRQn            =  60, /* 60  Serial Communication Interface (SERCOM0) */
  SERCOM0_4_IRQn            =  61, /* 61  Serial Communication Interface (SERCOM0) */
  SERCOM1_6_IRQn            =  62, /* 62  Serial Communication Interface (SERCOM1) */
  SERCOM1_5_IRQn            =  63, /* 63  Serial Communication Interface (SERCOM1) */
  SERCOM1_0_IRQn            =  64, /* 64  Serial Communication Interface (SERCOM1) */
  SERCOM1_1_IRQn            =  65, /* 65  Serial Communication Interface (SERCOM1) */
  SERCOM1_2_IRQn            =  66, /* 66  Serial Communication Interface (SERCOM1) */
  SERCOM1_3_IRQn            =  67, /* 67  Serial Communication Interface (SERCOM1) */
  SERCOM1_4_IRQn            =  68, /* 68  Serial Communication Interface (SERCOM1) */
  SERCOM2_6_IRQn            =  69, /* 69  Serial Communication Interface (SERCOM2) */
  SERCOM2_5_IRQn            =  70, /* 70  Serial Communication Interface (SERCOM2) */
  SERCOM2_0_IRQn            =  71, /* 71  Serial Communication Interface (SERCOM2) */
  SERCOM2_1_IRQn            =  72, /* 72  Serial Communication Interface (SERCOM2) */
  SERCOM2_2_IRQn            =  73, /* 73  Serial Communication Interface (SERCOM2) */
  SERCOM2_3_IRQn            =  74, /* 74  Serial Communication Interface (SERCOM2) */
  SERCOM2_4_IRQn            =  75, /* 75  Serial Communication Interface (SERCOM2) */
  SERCOM3_6_IRQn            =  76, /* 76  Serial Communication Interface (SERCOM3) */
  SERCOM3_5_IRQn            =  77, /* 77  Serial Communication Interface (SERCOM3) */
  SERCOM3_0_IRQn            =  78, /* 78  Serial Communication Interface (SERCOM3) */
  SERCOM3_1_IRQn            =  79, /* 79  Serial Communication Interface (SERCOM3) */
  SERCOM3_2_IRQn            =  80, /* 80  Serial Communication Interface (SERCOM3) */
  SERCOM3_3_IRQn            =  81, /* 81  Serial Communication Interface (SERCOM3) */
  SERCOM3_4_IRQn            =  82, /* 82  Serial Communication Interface (SERCOM3) */
  SERCOM4_6_IRQn            =  83, /* 83  Serial Communication Interface (SERCOM4) */
  SERCOM4_5_IRQn            =  84, /* 84  Serial Communication Interface (SERCOM4) */
  SERCOM4_0_IRQn            =  85, /* 85  Serial Communication Interface (SERCOM4) */
  SERCOM4_1_IRQn            =  86, /* 86  Serial Communication Interface (SERCOM4) */
  SERCOM4_2_IRQn            =  87, /* 87  Serial Communication Interface (SERCOM4) */
  SERCOM4_3_IRQn            =  88, /* 88  Serial Communication Interface (SERCOM4) */
  SERCOM4_4_IRQn            =  89, /* 89  Serial Communication Interface (SERCOM4) */
  SERCOM5_6_IRQn            =  90, /* 90  Serial Communication Interface (SERCOM5) */
  SERCOM5_5_IRQn            =  91, /* 91  Serial Communication Interface (SERCOM5) */
  SERCOM5_0_IRQn            =  92, /* 92  Serial Communication Interface (SERCOM5) */
  SERCOM5_1_IRQn            =  93, /* 93  Serial Communication Interface (SERCOM5) */
  SERCOM5_2_IRQn            =  94, /* 94  Serial Communication Interface (SERCOM5) */
  SERCOM5_3_IRQn            =  95, /* 95  Serial Communication Interface (SERCOM5) */
  SERCOM5_4_IRQn            =  96, /* 96  Serial Communication Interface (SERCOM5) */
  SERCOM6_6_IRQn            =  97, /* 97  Serial Communication Interface (SERCOM6) */
  SERCOM6_5_IRQn            =  98, /* 98  Serial Communication Interface (SERCOM6) */
  SERCOM6_0_IRQn            =  99, /* 99  Serial Communication Interface (SERCOM6) */
  SERCOM6_1_IRQn            = 100, /* 100 Serial Communication Interface (SERCOM6) */
  SERCOM6_2_IRQn            = 101, /* 101 Serial Communication Interface (SERCOM6) */
  SERCOM6_3_IRQn            = 102, /* 102 Serial Communication Interface (SERCOM6) */
  SERCOM6_4_IRQn            = 103, /* 103 Serial Communication Interface (SERCOM6) */
  SERCOM7_6_IRQn            = 104, /* 104 Serial Communication Interface (SERCOM7) */
  SERCOM7_5_IRQn            = 105, /* 105 Serial Communication Interface (SERCOM7) */
  SERCOM7_0_IRQn            = 106, /* 106 Serial Communication Interface (SERCOM7) */
  SERCOM7_1_IRQn            = 107, /* 107 Serial Communication Interface (SERCOM7) */
  SERCOM7_2_IRQn            = 108, /* 108 Serial Communication Interface (SERCOM7) */
  SERCOM7_3_IRQn            = 109, /* 109 Serial Communication Interface (SERCOM7) */
  SERCOM7_4_IRQn            = 110, /* 110 Serial Communication Interface (SERCOM7) */
  TCC0_OTHER_IRQn           = 125, /* 125 Timer Counter for Control Applications (TCC0) */
  TCC0_CNT_TRIG_IRQn        = 126, /* 126 Timer Counter for Control Applications (TCC0) */
  TCC0_MC0_IRQn             = 127, /* 127 Timer Counter for Control Applications (TCC0) */
  TCC0_MC1_IRQn             = 128, /* 128 Timer Counter for Control Applications (TCC0) */
  TCC0_MC2_IRQn             = 129, /* 129 Timer Counter for Control Applications (TCC0) */
  TCC0_MC3_IRQn             = 130, /* 130 Timer Counter for Control Applications (TCC0) */
  TCC0_MC4_IRQn             = 131, /* 131 Timer Counter for Control Applications (TCC0) */
  TCC0_MC5_IRQn             = 132, /* 132 Timer Counter for Control Applications (TCC0) */
  TCC0_MC6_IRQn             = 133, /* 133 Timer Counter for Control Applications (TCC0) */
  TCC0_MC7_IRQn             = 134, /* 134 Timer Counter for Control Applications (TCC0) */
  TCC1_OTHER_IRQn           = 135, /* 135 Timer Counter for Control Applications (TCC1) */
  TCC1_CNT_TRIG_IRQn        = 136, /* 136 Timer Counter for Control Applications (TCC1) */
  TCC1_MC0_IRQn             = 137, /* 137 Timer Counter for Control Applications (TCC1) */
  TCC1_MC1_IRQn             = 138, /* 138 Timer Counter for Control Applications (TCC1) */
  TCC1_MC2_IRQn             = 139, /* 139 Timer Counter for Control Applications (TCC1) */
  TCC1_MC3_IRQn             = 140, /* 140 Timer Counter for Control Applications (TCC1) */
  TCC1_MC4_IRQn             = 141, /* 141 Timer Counter for Control Applications (TCC1) */
  TCC1_MC5_IRQn             = 142, /* 142 Timer Counter for Control Applications (TCC1) */
  TCC1_MC6_IRQn             = 143, /* 143 Timer Counter for Control Applications (TCC1) */
  TCC1_MC7_IRQn             = 144, /* 144 Timer Counter for Control Applications (TCC1) */
  TCC2_OTHER_IRQn           = 145, /* 145 Timer Counter for Control Applications (TCC2) */
  TCC2_CNT_TRIG_IRQn        = 146, /* 146 Timer Counter for Control Applications (TCC2) */
  TCC2_MC0_IRQn             = 147, /* 147 Timer Counter for Control Applications (TCC2) */
  TCC2_MC1_IRQn             = 148, /* 148 Timer Counter for Control Applications (TCC2) */
  TCC2_MC2_IRQn             = 149, /* 149 Timer Counter for Control Applications (TCC2) */
  TCC2_MC3_IRQn             = 150, /* 150 Timer Counter for Control Applications (TCC2) */
  TCC2_MC4_IRQn             = 151, /* 151 Timer Counter for Control Applications (TCC2) */
  TCC2_MC5_IRQn             = 152, /* 152 Timer Counter for Control Applications (TCC2) */
  TCC3_OTHER_IRQn           = 153, /* 153 Timer Counter for Control Applications (TCC3) */
  TCC3_CNT_TRIG_IRQn        = 154, /* 154 Timer Counter for Control Applications (TCC3) */
  TCC3_MC0_IRQn             = 155, /* 155 Timer Counter for Control Applications (TCC3) */
  TCC3_MC1_IRQn             = 156, /* 156 Timer Counter for Control Applications (TCC3) */
  TCC4_OTHER_IRQn           = 157, /* 157 Timer Counter for Control Applications (TCC4) */
  TCC4_CNT_TRIG_IRQn        = 158, /* 158 Timer Counter for Control Applications (TCC4) */
  TCC4_MC0_IRQn             = 159, /* 159 Timer Counter for Control Applications (TCC4) */
  TCC4_MC1_IRQn             = 160, /* 160 Timer Counter for Control Applications (TCC4) */
  TCC5_OTHER_IRQn           = 161, /* 161 Timer Counter for Control Applications (TCC5) */
  TCC5_CNT_TRIG_IRQn        = 162, /* 162 Timer Counter for Control Applications (TCC5) */
  TCC5_MC0_IRQn             = 163, /* 163 Timer Counter for Control Applications (TCC5) */
  TCC5_MC1_IRQn             = 164, /* 164 Timer Counter for Control Applications (TCC5) */
  TCC6_OTHER_IRQn           = 165, /* 165 Timer Counter for Control Applications (TCC6) */
  TCC6_CNT_TRIG_IRQn        = 166, /* 166 Timer Counter for Control Applications (TCC6) */
  TCC6_MC0_IRQn             = 167, /* 167 Timer Counter for Control Applications (TCC6) */
  TCC6_MC1_IRQn             = 168, /* 168 Timer Counter for Control Applications (TCC6) */
  TCC7_OTHER_IRQn           = 169, /* 169 Timer Counter for Control Applications (TCC7) */
  TCC7_CNT_TRIG_IRQn        = 170, /* 170 Timer Counter for Control Applications (TCC7) */
  TCC7_MC0_IRQn             = 171, /* 171 Timer Counter for Control Applications (TCC7) */
  TCC7_MC1_IRQn             = 172, /* 172 Timer Counter for Control Applications (TCC7) */
  TCC8_OTHER_IRQn           = 173, /* 173 Timer Counter for Control Applications (TCC8) */
  TCC8_CNT_TRIG_IRQn        = 174, /* 174 Timer Counter for Control Applications (TCC8) */
  TCC8_MC0_IRQn             = 175, /* 175 Timer Counter for Control Applications (TCC8) */
  TCC8_MC1_IRQn             = 176, /* 176 Timer Counter for Control Applications (TCC8) */
  TCC9_OTHER_IRQn           = 177, /* 177 Timer Counter for Control Applications (TCC9) */
  TCC9_CNT_TRIG_IRQn        = 178, /* 178 Timer Counter for Control Applications (TCC9) */
  TCC9_MC0_IRQn             = 179, /* 179 Timer Counter for Control Applications (TCC9) */
  TCC9_MC1_IRQn             = 180, /* 180 Timer Counter for Control Applications (TCC9) */
  TCC9_MC2_IRQn             = 181, /* 181 Timer Counter for Control Applications (TCC9) */
  TCC9_MC3_IRQn             = 182, /* 182 Timer Counter for Control Applications (TCC9) */
  TCC9_MC4_IRQn             = 183, /* 183 Timer Counter for Control Applications (TCC9) */
  TCC9_MC5_IRQn             = 184, /* 184 Timer Counter for Control Applications (TCC9) */
  ADC_GLOBAL_IRQn           = 185, /* 185 ADC_GLOBAL (ADC)                    */
  ADC_CORE1_IRQn            = 186, /* 186 ADC_CORE1 (ADC)                     */
  ADC_CORE2_IRQn            = 187, /* 187 ADC_CORE2 (ADC)                     */
  ADC_CORE3_IRQn            = 188, /* 188 ADC_CORE3 (ADC)                     */
  ADC_CORE4_IRQn            = 189, /* 189 ADC_CORE4 (ADC)                     */
  AC_IRQn                   = 190, /* 190 Analog Comparator Controller (AC)   */
  PTC_IRQn                  = 191, /* 191 Peripheral Touch Controller (PTC)   */
  SPI_IXS0_IRQn             = 192, /* 192 Audio SPI with 8 channels compatibilty (SPI_IXS0) */
  SPI_IXS1_IRQn             = 193, /* 193 Audio SPI with 8 channels compatibilty (SPI_IXS1) */
  CAN0_IRQn                 = 194, /* 194 Control Area Network (CAN0)         */
  CAN1_IRQn                 = 195, /* 195 Control Area Network (CAN1)         */
  CAN2_IRQn                 = 196, /* 196 Control Area Network (CAN2)         */
  CAN3_IRQn                 = 197, /* 197 Control Area Network (CAN3)         */
  CAN4_IRQn                 = 198, /* 198 Control Area Network (CAN4)         */
  CAN5_IRQn                 = 199, /* 199 Control Area Network (CAN5)         */
  ETH_PRI_Q_0_IRQn          = 202, /* 202 Ethernet Controller (ETH)           */
  ETH_PRI_Q_1_IRQn          = 203, /* 203 Ethernet Controller (ETH)           */
  ETH_PRI_Q_2_IRQn          = 204, /* 204 Ethernet Controller (ETH)           */
  ETH_PRI_Q_3_IRQn          = 205, /* 205 Ethernet Controller (ETH)           */
  ETH_PRI_Q_4_IRQn          = 206, /* 206 Ethernet Controller (ETH)           */
  ETH_PRI_Q_5_IRQn          = 207, /* 207 Ethernet Controller (ETH)           */
  SQI0_IRQn                 = 208, /* 208 Polaris Serial Quad Interface SIB (SQI0) */
  SQI1_IRQn                 = 209, /* 209 Polaris Serial Quad Interface SIB (SQI1) */
  TRNG_IRQn                 = 210, /* 210 True Random Generator (TRNG)        */
  SDMMC0_IRQn               = 211, /* 211 SD/MMC Host Controller (SDMMC0)     */
  SDMMC1_IRQn               = 212, /* 212 SD/MMC Host Controller (SDMMC1)     */
  USBHS0_IRQn               = 213, /* 213 USB High Speed (USBHS0)             */
  USBHS1_IRQn               = 214, /* 214 USB High Speed (USBHS1)             */
  MLB_GENERAL_IRQn          = 218, /* 218 Media Local Bus (MLB)               */
  MLB_BUSREQ_IRQn           = 219, /* 219 Media Local Bus (MLB)               */
  CM7H_CTIIRQ_0_IRQn        = 220, /* 220 CM7H_CTIIRQ_0 (CM7H)                */
  CM7H_CTIIRQ_1_IRQn        = 221, /* 221 CM7H_CTIIRQ_1 (CM7H)                */

  PERIPH_MAX_IRQn           = 221  /* Max peripheral ID */
} IRQn_Type;
